In [4]:
%load_ext sql

/root/anaconda3/lib/python3.6/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/root/anaconda3/lib/python3.6/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [5]:
%sql sqlite:///sample1.db

'Connected: None@sample1.db'

In [7]:
%%sql create table dept (
        deptno int not null,
        deptname char(10),
        floor int,
        primary key (deptno)
        );

0 rows affected.

[]

In [11]:
%%sql insert into dept values(1, '영업', 8);
insert into dept values(2, '기획', 10);
insert into dept values(3, '개발', 9);
insert into dept values(4, '총부', 7);

IntegrityError: (sqlite3.IntegrityError) UNIQUE constraint failed: dept.deptno [SQL: "insert into dept values(1, '영업', 8);"]

In [12]:
%%sql create table emp (
        empno int not null,
        empname char(10) unique,
        title char(10) default '사원',
        manager int,
        salary int check(salary < 6000000),
        dno int,
        primary key(empno),
        foreign key(manager) references emp(empno),
        foreign key(dno) references dept(deptno) on update cascade
        );

0 rows affected.

[]

In [13]:
%%sql insert into emp values(4377, '이성래', '사장', NULL, 5000000, 2);
insert into emp values(3426, '박영권', '과장', 4377, 3000000, 1);
insert into emp values(3011, '이수민', '부장', 4377, 4000000, 3);
insert into emp values(3427, '최종철', '사원', 3011, 1500000, 3);
insert into emp values(1003, '조민희', '과장', 4377, 3000000, 2);
insert into emp values(2106, '김창섭', '대리', 1003, 2500000, 2);
insert into emp values(1365, '김상원', '사원', 3426, 1500000, 1);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%%sql create view emp_planning
        as
        select e.empname, e.title, e.salary
        from emp e, dept d
        where e.dno = d.deptno and d.deptname = '기획'

1 rows affected.

[]

In [15]:
%%sql create table student (
        sid smallint constraint const_student_pk PRIMARY KEY,
        sname char(20) NULL,
        major varchar(30) NULL,
        gradelevel char(2)
        constraint const_student_gr check ( gradelevel in ('GR', 'SO', 'GR', 'SN', 'JR', 'FR')),
        Age smallint NULL
        constraint const_student_age check ( age > 0 )
) ;

1 rows affected.

[]

In [16]:
%%sql create table class (
        cname char(5),
        time varchar(7),
        room char(5),
        constraint const_class_pk primary key (cname)
        );

1 rows affected.

[]

In [17]:
%%sql create table enrollment (
        studentnumber smallint,
        classname char(5),
        positionnumber smallint,
        constraint const_enroll_pk primary key (studentnumber, classname),
        constraint const_enroll_fk_snum foreign key (studentnumber) references student(sid),
        constraint const_enroll_fk_cname foreign key (classname) references class(cname)
);

1 rows affected.

[]

In [18]:
%%sql insert into student values ( 100, 'JONES', 'HISTORY', 'GR', 21);
insert into student values ( 150, 'PARKS', 'ACCOUNTING', 'SO', 19);
insert into student values ( 200, 'BAKER', 'MATH', 'GR', 50);
insert into student values ( 250, 'GLASS', 'HISTORY', 'SN', 50);
insert into student values ( 300, 'BAKER', 'ACCOUNTING', 'SN', 41);
insert into student values ( 350, 'RUSSEL', 'MATH', 'JR', 20);
insert into student values ( 400, 'RYE', 'ACCOUNTING', 'FR', 18);
insert into student values ( 450, 'JONES', 'HISTORY', 'SN', 24);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [19]:
%%sql insert into class values ( 'BA200', 'M-F9', 'SC110');
insert into class values ( 'BD445', 'MWF3', 'SC213');
insert into class values ( 'BF410', 'MWF8', 'SC213');
insert into class values ( 'CS150', 'MWF3', 'EA304');
insert into class values ( 'CS250', 'MWF12', 'EB210');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [20]:
%%sql insert into enrollment values (100, 'BD445', 1);
insert into enrollment values (150, 'BA200', 1);
insert into enrollment values (200, 'BD445', 2);
insert into enrollment values (200, 'CS250', 1);
insert into enrollment values (300, 'CS150', 1);
insert into enrollment values (400, 'BA200', 2);
insert into enrollment values (400, 'BF410', 1);
insert into enrollment values (400, 'CS250', 2);
insert into enrollment values (450, 'BA200', 3);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [21]:
%%sql create table s (
        sno char(5) NOT NULL primary key,
        sname char(10) NULL,
        city char(10) NULL
        );

1 rows affected.

[]

In [22]:
%%sql create table p (
        pno char(5) NOT NULL
        primary key,
        pname char(10) NULL,
        color char(10) NULL,
        WEIGHT SMALLINT NULL,
        city char(10) NULL
        );

1 rows affected.

[]

In [23]:
%%sql create table sp (
        sno char(5) NOT NULL,
        pno char(5) NOT NULL,
        qty SMALLINT NULL,
        constraint PK_SP primary key (sno, pno),
        constraint FK_SP_S foreign key (sno) references S on update cascade,
        constraint FK_SP_P foreign key (pno) references P on delete cascade
        );

1 rows affected.

[]

In [24]:
%%sql insert into s values ('s01', 'Smith', 'London');
insert into s values ('s02', 'jones', 'Paris');
insert into s values ('s03', 'blakes', 'Paris');
insert into s values ('s04', 'clark', 'London');
insert into s values ('s05', 'adams', 'Athenes');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [25]:
%%sql insert into p values ('p01', 'Nut', 'red', 12, 'London');
insert into p values ('p02', 'Bolt', 'green', 17, 'Paris');
insert into p values ('p03', 'Screw', 'blue', 17, 'Rome');
insert into p values ('p04', 'Screw', 'red', 14, 'London');
insert into p values ('p05', 'cam', 'blue', 12, 'Paris');
insert into p values ('p06', 'cog', 'red', 19, 'London');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [26]:
%%sql insert into sp values ('s01', 'p01', 300);
insert into sp values ('s01', 'p02', 200);
insert into sp values ('s01', 'p03', 400);
insert into sp values ('s01', 'p04', 500);
insert into sp values ('s01', 'p05', 100);
insert into sp values ('s01', 'p06', 200);
insert into sp values ('s02', 'p01', 300);
insert into sp values ('s02', 'p02', 400);
insert into sp values ('s03', 'p02', 200);
insert into sp values ('s04', 'p04', 300);
insert into sp values ('s05', 'p05', 400);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [30]:
%sql select * from dept;

Done.

[(1, '영업', 8), (2, '기획', 10), (3, '개발', 9), (4, '총부', 7)]

In [31]:
%sql select *from emp;

Done.

[(4377, '이성래', '사장', None, 5000000, 2),
 (3426, '박영권', '과장', 4377, 3000000, 1),
 (3011, '이수민', '부장', 4377, 4000000, 3),
 (3427, '최종철', '사원', 3011, 1500000, 3),
 (1003, '조민희', '과장', 4377, 3000000, 2),
 (2106, '김창섭', '대리', 1003, 2500000, 2),
 (1365, '김상원', '사원', 3426, 1500000, 1)]

In [32]:
%sql select * from emp_planning;

Done.

[('이성래', '사장', 5000000), ('조민희', '과장', 3000000), ('김창섭', '대리', 2500000)]

In [33]:
%sql select * from student;

Done.

[(100, 'JONES', 'HISTORY', 'GR', 21),
 (150, 'PARKS', 'ACCOUNTING', 'SO', 19),
 (200, 'BAKER', 'MATH', 'GR', 50),
 (250, 'GLASS', 'HISTORY', 'SN', 50),
 (300, 'BAKER', 'ACCOUNTING', 'SN', 41),
 (350, 'RUSSEL', 'MATH', 'JR', 20),
 (400, 'RYE', 'ACCOUNTING', 'FR', 18),
 (450, 'JONES', 'HISTORY', 'SN', 24)]

In [34]:
%sql select * from class;

Done.

[('BA200', 'M-F9', 'SC110'),
 ('BD445', 'MWF3', 'SC213'),
 ('BF410', 'MWF8', 'SC213'),
 ('CS150', 'MWF3', 'EA304'),
 ('CS250', 'MWF12', 'EB210')]

In [35]:
%sql select * from enrollment;

Done.

[(100, 'BD445', 1),
 (150, 'BA200', 1),
 (200, 'BD445', 2),
 (200, 'CS250', 1),
 (300, 'CS150', 1),
 (400, 'BA200', 2),
 (400, 'BF410', 1),
 (400, 'CS250', 2),
 (450, 'BA200', 3)]

In [36]:
%sql select * from s;

Done.

[('s01', 'Smith', 'London'),
 ('s02', 'jones', 'Paris'),
 ('s03', 'blakes', 'Paris'),
 ('s04', 'clark', 'London'),
 ('s05', 'adams', 'Athenes')]

In [37]:
%sql select * from p;

Done.

[('p01', 'Nut', 'red', 12, 'London'),
 ('p02', 'Bolt', 'green', 17, 'Paris'),
 ('p03', 'Screw', 'blue', 17, 'Rome'),
 ('p04', 'Screw', 'red', 14, 'London'),
 ('p05', 'cam', 'blue', 12, 'Paris'),
 ('p06', 'cog', 'red', 19, 'London')]

In [38]:
%sql select * from sp;

Done.

[('s01', 'p01', 300),
 ('s01', 'p02', 200),
 ('s01', 'p03', 400),
 ('s01', 'p04', 500),
 ('s01', 'p05', 100),
 ('s01', 'p06', 200),
 ('s02', 'p01', 300),
 ('s02', 'p02', 400),
 ('s03', 'p02', 200),
 ('s04', 'p04', 300),
 ('s05', 'p05', 400)]